src/DataProcessors/МассоваяРассылкаАктовСверок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>МассоваяРассылкаАктовСверок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтараяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылатьПоставщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылатьПокупателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПриостановленные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЕслиНетДолгов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтараяОрганизацияТребуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/МассоваяРассылкаАктовСверок/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОрганизации();
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьОрганизации()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Организации.Ссылка
	                |ИЗ
	                |	Справочник.Организации КАК Организации";
	СписокОрганизаций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.НачалоПериода = Период.ДатаНачала;
	Объект.КонецПериода = Период.ДатаОкончания;	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимостьДоступность()
	Элементы.СтараяОрганизация.Видимость = Объект.СтараяОрганизацияТребуется;
КонецПроцедуры

&НаКлиенте
Процедура РазослатьАктыСверок(Команда)
	ПеренестиДанныеИзФормыВОбъект();
	Если ПроверитьЗаполнение() Тогда 
		РазослатьАктыСверокНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РазослатьАктыСверокНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьРассылку();
КонецПроцедуры

&НаКлиенте 
Процедура ПеренестиДанныеИзФормыВОбъект()
	Объект.Организации.Очистить();
	Для Каждого Стр Из СписокОрганизаций Цикл 
		Если Стр.Пометка Тогда 
			Объект.Организации.Добавить().Организация = Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Объект.ВыгружатьЕслиНетДолгов = НаличиеДолга = 0;
	Объект.ТолькоПриостановленные = ВидДоговора = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СтараяОрганизацияТребуетсяПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры
